# Notebook Structure for SQL EDA

## 1️⃣ Introduction & Setup
- Brief project overview  
- Connect to the SQL database (e.g., PostgreSQL, MySQL, SQL Server)  
- Load required Python libraries (for executing SQL, not visualization)  

## 2️⃣ Data Overview
- Query to inspect the dataset (e.g., `SELECT * FROM table LIMIT 10;`)  
- Basic structure: column names, data types  

## 3️⃣ Missing Values & Data Cleaning
- Query to check for missing values  
- Strategies for handling missing data  
- Export cleaned data to CSV for Tableau/Power BI  

## 4️⃣ Summary Statistics
- Queries to calculate mean, median, min, max, standard deviation  
- Export results as a CSV for visualization  

## 5️⃣ Distributions & Trends
- Queries for frequency distributions, categorical counts, and trends  
- Export findings to a structured format  

## 6️⃣ Correlation Analysis
- Queries to compute correlations (if applicable)  
- Insights from SQL-based statistical summaries  

## 7️⃣ Final Summary & Export
- Write key insights in Markdown format  
- Save all processed data as CSVs for use in Tableau/Power BI

In [1]:
import mysql.connector as sql
from tabulate import tabulate
import pandas as pd

In [2]:
# first we will make connection to the server
connection = sql.connect(
    host = "localhost",
    user = "root",
    password = "Ayoub1111",
    allow_local_infile = True,
    use_pure = True
)

In [3]:
cursor = connection.cursor()

In [4]:
cursor.execute("CREATE DATABASE IF NOT EXISTS employees")

In [5]:
connection.database = "employees"

In [6]:
cursor.execute("select * from titles limit 10")
rows = cursor.fetchall()

In [7]:
for row in rows:
    print(row)

(10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1))
(10002, 'Staff', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1))
(10003, 'Senior Engineer', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1))
(10004, 'Engineer', datetime.date(1986, 12, 1), datetime.date(1995, 12, 1))
(10004, 'Senior Engineer', datetime.date(1995, 12, 1), datetime.date(9999, 1, 1))
(10005, 'Senior Staff', datetime.date(1996, 9, 12), datetime.date(9999, 1, 1))
(10005, 'Staff', datetime.date(1989, 9, 12), datetime.date(1996, 9, 12))
(10006, 'Senior Engineer', datetime.date(1990, 8, 5), datetime.date(9999, 1, 1))
(10007, 'Senior Staff', datetime.date(1996, 2, 11), datetime.date(9999, 1, 1))
(10007, 'Staff', datetime.date(1989, 2, 10), datetime.date(1996, 2, 11))

### Get a Quick Overview of the Data
- display tables inside the employees database

In [8]:
query1 = "select * from current_dept_emp limit 10"
query2 = "select * from departments limit 10"
query3 = "select * from dept_emp limit 10"
query4 = "select * from dept_emp_latest_date limit 10"
query5 = "select * from dept_manager limit 10"
query6 = "select * from employees limit 10"
query7 = "select * from  salaries limit 10"
query8 = "select * from titles limit 10"

In [9]:
current_dept_emp = pd.read_sql_query(query1, connection)
departments = pd.read_sql_query(query2, connection)
dept_emp = pd.read_sql_query(query3, connection)
dept_emp_latest_date = pd.read_sql_query(query4, connection)
dept_manager = pd.read_sql_query(query5, connection)
employees = pd.read_sql_query(query6, connection)
salaries = pd.read_sql_query(query7, connection)
titles = pd.read_sql_query(query8, connection)

/tmp/ipykernel_22678/2219627782.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  current_dept_emp = pd.read_sql_query(query1, connection)
/tmp/ipykernel_22678/2219627782.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  departments = pd.read_sql_query(query2, connection)
/tmp/ipykernel_22678/2219627782.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_emp = pd.read_sql_query(query3, connection)
/tmp/ipykernel_22678/2219627782.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_emp_latest_date = pd.read_sql_query(query4, connection)
/tmp/ipykernel_22678/2219627782.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_manager = pd.read_sql_query(query5, connection)
/tmp/ipykernel_22678/2219627782.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employees = pd.read_sql_query(query6, connection)
/tmp/ipykernel_22678/2219627782.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  salaries = pd.read_sql_query(query7, connection)
/tmp/ipykernel_22678/2219627782.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  titles = pd.read_sql_query(query8, connection)

In [11]:
current_dept_emp.head(10)

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01
5   10006    d005  1990-08-05  9999-01-01
6   10007    d008  1989-02-10  9999-01-01
7   10008    d005  1998-03-11  2000-07-31
8   10009    d006  1985-02-18  9999-01-01
9   10010    d006  2000-06-26  9999-01-01

In [14]:
departments.head(10)

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

In [18]:
dept_emp.head(10)

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01
5   10006    d005  1990-08-05  9999-01-01
6   10007    d008  1989-02-10  9999-01-01
7   10008    d005  1998-03-11  2000-07-31
8   10009    d006  1985-02-18  9999-01-01
9   10010    d004  1996-11-24  2000-06-26

In [17]:
dept_emp_latest_date.head(10)

   emp_no   from_date     to_date
0   10001  1986-06-26  9999-01-01
1   10002  1996-08-03  9999-01-01
2   10003  1995-12-03  9999-01-01
3   10004  1986-12-01  9999-01-01
4   10005  1989-09-12  9999-01-01
5   10006  1990-08-05  9999-01-01
6   10007  1989-02-10  9999-01-01
7   10008  1998-03-11  2000-07-31
8   10009  1985-02-18  9999-01-01
9   10010  2000-06-26  9999-01-01

In [19]:
dept_manager.head(10)

   emp_no dept_no   from_date     to_date
0  110022    d001  1985-01-01  1991-10-01
1  110039    d001  1991-10-01  9999-01-01
2  110085    d002  1985-01-01  1989-12-17
3  110114    d002  1989-12-17  9999-01-01
4  110183    d003  1985-01-01  1992-03-21
5  110228    d003  1992-03-21  9999-01-01
6  110303    d004  1985-01-01  1988-09-09
7  110344    d004  1988-09-09  1992-08-02
8  110386    d004  1992-08-02  1996-08-30
9  110420    d004  1996-08-30  9999-01-01

In [20]:
employees.head(10)

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25
5   10001   71046  1991-06-25  1992-06-24
6   10001   74333  1992-06-24  1993-06-24
7   10001   75286  1993-06-24  1994-06-24
8   10001   75994  1994-06-24  1995-06-24
9   10001   76884  1995-06-24  1996-06-23

In [22]:
salaries.head(10)

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25
5   10001   71046  1991-06-25  1992-06-24
6   10001   74333  1992-06-24  1993-06-24
7   10001   75286  1993-06-24  1994-06-24
8   10001   75994  1994-06-24  1995-06-24
9   10001   76884  1995-06-24  1996-06-23

In [23]:
titles.head(10)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01
5   10005     Senior Staff  1996-09-12  9999-01-01
6   10005            Staff  1989-09-12  1996-09-12
7   10006  Senior Engineer  1990-08-05  9999-01-01
8   10007     Senior Staff  1996-02-11  9999-01-01
9   10007            Staff  1989-02-10  1996-02-11

In [27]:
query = """
    select title, max(salary) as slalry_peer_title from titles inner join salaries on titles.emp_no = salaries.emp_no group by title limit 10;
"""


pd.read_sql_query(query, connection)

/tmp/ipykernel_22678/2050314116.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, connection)

                title  slalry_peer_title
0     Senior Engineer             133038
1               Staff             158220
2            Engineer             132552
3        Senior Staff             158220
4  Assistant Engineer             120417
5    Technique Leader             144434
6             Manager             108407

In [15]:
query = """
    show tables;
"""


pd.read_sql_query(query, connection)

/tmp/ipykernel_22678/1995914762.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, connection)

    Tables_in_employees
0      current_dept_emp
1           departments
2              dept_emp
3  dept_emp_latest_date
4          dept_manager
5             employees
6              salaries
7                titles

In [20]:
query = """
    select min(salary) as min_salary, avg(salary) as avg_salary, max(salary) as max_salary from salaries limit 20;
"""


pd.read_sql_query(query, connection)

/tmp/ipykernel_22678/4090035913.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, connection)

   min_salary  avg_salary  max_salary
0       38735  63761.2043      158220

In [24]:
query = """
    select * from departments inner join salaries on  departments.emp_no = salaries.emp_no limit 20;
"""


pd.read_sql_query(query, connection)

/tmp/ipykernel_22678/3259868558.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, connection)

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

In [43]:
query = """
    select count(gender) as total_number_of_male from employees where gender = 'M';
"""


pd.read_sql_query(query, connection)

/tmp/ipykernel_22678/514603648.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, connection)

   total_number_of_male
0                179973

In [39]:
query = """
    select distinct(last_name), max(salary) as max_salary from employees inner join salaries on employees.emp_no = salaries.emp_no group by last_name limit 20;
"""


pd.read_sql_query(query, connection)

/tmp/ipykernel_22678/3379291053.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, connection)

         last_name  max_salary
0           Aamodt      129115
1            Acton      115108
2           Adachi      131462
3        Aingworth      128292
4         Akaboshi      130953
5           Akazan      123113
6          Akiyama      132377
7        Alameldin      155377
8    Albarhamtoshy      130681
9           Alblas      122176
10         Alencar      113648
11           Aloia      109319
12          Aloisi      108689
13           Alpay      131188
14           Alpin      116273
15        Alvarado      112622
16  Ambroszkiewicz      116377
17         Anandan      136414
18       Ananiadou      122141
19       Andreotta      114908